[
  {
    "title": "Summer Recap",
    "date": "September 13, 2024",
    "content": "Summer is wrapping up soon, and my second year at UCLA is just around the corner. So many things happened and I feel like I've taken this time to set goals for myself moving forward. Nevertheless, here were some of my highlights: \n **Interned at Cleveland Clinic**\n I lived in Cleveland for two months this summer and was a lab researcher at the Lerner Research Institute. This experience basically convinced me I need a PhD, because I felt like an infant being only an undergrad. The others in the lab were so smart it was so motivating for me. I learned the math I needed for this research just in time, and it was super challenging but also super stimulating. I wrote an abstract and am working on a paper right now. The 9-5 felt like an 11-3. While in Cleveland, I also got to visit LeBron's home in Akron. I watched the Olympic Gold Medal Men's Basketball Match from LeBron's community center theater. I was reunited with my childhood best friend who I hadn't seen in 7 years. \n **Watching the Olympics** \n I'm at an age now where the Olympic athletes are all around my age, some even younger. I watched every single swimming final, and despite burning out in high school and hating the sport, it brought out all the things I love about swimming. I've been super motivated since to achieve my potential in the pool. Even though I'm past high school and NCAA recruiting, I still have ambitious times and goals that were never achieved, and I am determined to reach those goals in my lifetime. I am about to enter the physical peak of my life, and I realize that I am in fact capable of way more than I accomplished in high school, given my results at Club Swimming Nationals earlier this year. I think watching the women swim left me more inspired than watching the men swim in some ways. Summer McIntosh is genuinely incredible. I saw my favorite swimmers David Popovici and Leon Marchand succeed, watched some other insane swims like Pan Zhanle's 100 Free and Leon and Summer's 200 Fly, and witnessed Katie Ledecky's greatness.\n **Weekend in New York** \n I visited my old middle school friend Patrick who is at West Point and my freshman year roommate Jeff, who lives in NYC. I was lucky enough to be able to stay with Jeff, and Patrick had extra tickets to see AJR in Madison Square Garden, so I got to go to a great concert. The night before I returned to Cleveland, I had dinner with Macie, who I hadn't seen in almost two years. Lastly, I saw the MJ musical at Neil Simon Theater. Michael Jackson is my top artist on Spotify, and this was a magical experience. Broadway actors always leave me in awe with their talent and passion. \n **Overall:** I listened to a lot of theater music. Sang a lot."
 },

  {
    "title": "Spring Quarter Wrapped and Freshman Year Thoughts",
    "date": "June 15, 2024",
    "content": "Today I'm flying home from UCLA! I just finished my first year in college, which has been quite an amazing experience. While this past year has been absolutely amazing, I cannot say the same about this past week. I got food poisoning from Epicuria on Monday night of finals week. Thankfully, I have some amazing friends that really helped me through it, who also are the reason I was able to still finish the week. I couldn't really study at all Tuesday and was just lying in bed, so my Wednesday honors linear algebra final was pretty rough as well as my physics final. Move out was also extremely chaotic but worked out in the end.\n **Classes:** \n CS 32: Super fun, tons of work, amazing professor, friendships were made from this class from the 70 hours project 3 took. \n MATH 115AH: First honors class and first upper division class. Was definitely a challenge, but once again I absolutely loved this class. Morgan Opie was a truly wonderful professor and made this class so enriching. I learned a ton and gained some mathematically maturity. Proofs are beautiful. \n PHYSICS 1A: David Saltzberg was a pretty funny professor, cool to see how he is pretty famous and was a consultant for the Big Bang Theory. Had this class with multiple friends, so it was fine. Kinda sucked that lecture was at 4pm every day, but otherwise pretty mediocre class.\n GENDER 10: Pretty much everything after Week 4 or 5 got cancelled due to the protests, so we didn't really do anything. I just wrote a couple of essays. \n **Highlights from the quarter:** \n **Week 1:** I went to Indianapolis to swim at the amazing IUPUI Natatorium for College Club Swimming Nationals. I was actually really close to my best times from high school, and even got a best time in my 100 Free (49.35). I went 1:49.48 and 2:02.79 in the 200 Free and 200 IM respectively. I feel really good about these times, because I've pretty much been training 1-2 times per week for 2000 yards at a time, which is like 5% of the volume of my high school training. I feel really motivated to focus on traning more next year and see what I am capable of. Nationals next year will be at ASU, so that will be amazing, since it is closer and the pool is outdoor. \n **Week 5:**  TBG retreat was this weekend. We went to Oceanside and honestly it was way too exhausting with way too many people. I slept on the couch and froze throughout the night. Either way, it was super fun to have some bonding time with club members. I stayed at a beach house in Huntington Beach for a night first before heading down to Carlsbad. \n **Week 8:**  I turned 19 this week! I was pretty swamped from the CS 32 project 3, but I started early and was never under time pressure. I celebrated at MeatLove KBBQ on the weekend with my amazing friends. \n **Week 9:** Had our TBG banquet and Club Swimming banquet, which was on a boat. I finally put my suits to use! \n **Week 10:** I destroyed my CS final (in a good way). Linear Algebra was pretty difficult but I was able to keep up with the homeworks which took forever. I was able to manage the stress during this time as CS had another project and homework going along with the final \n **Lessons from the quarter:** \n **It's important to have good habits**. I was pretty addicted to Creamy Boys matcha ice cream this quarter, and I also had a pretty poor sleep schedule. This came back to bite me pretty hard as everything came crashing down when I got really sick finals week and took my finals on a 102 degree fever. I also stopped swimming after Week 1 and I feel like that didn't give me more time-it just made me less efficient. I realize swimming is something I can never stop doing. I also need to start waking up early and sleeping early. I realized I cannot afford getting sick in this quarter system. \n **Don't give up on a class**. I scored an outrageous 18/35 on my first CS 32 midterm (the bottom 25th percentile was like around 21/35) and thought it was over after that. I thought I did super well and when I saw the email with my score, I was more surprised than disappointed. From there on, I fully locked in and did well on the remaining projects. I scored an 58/65 on the second midterm which was above the 75th percentile. I scored a 90/100 on the final and finished the class with an A. This class wasn't particularly hard, but there was so much work required and a lot of precision needed. I realized the difference between an A and an F was all in small details in a class like this. Shout out to David Smallberg for being an amazing professor. I will miss your lectures. \n **Trust Your Abilities**. I opened up a barbershop out of the communal bathroom and it became so successful it's kind of crazy to think about. I was super intimidated before starting it and was full of self-doubt because I didn't have tons of experience and was afraid I would mess up really badly. I had learned everything on YouTube and was just going off intuition. But shout out to those who trusted me at the beginning and let me develop my skills, specifically Eiden. I can confidently say I'm a highly skilled barber now. \n **Overall:** \n I had a great first year experience, matured a lot, and most importantly, learned a lot-academically and socially. Also shout out to my roommates Jeff and Max and others on the floor that made Rieber 7 South a super fun place. I made a lot of friends and joined many clubs, and couldn't have asked for a better first year. I can't wait for next year."
  }, 
  {
    "title": "Busy Winter Quarter",
    "date": "March 22, 2024",
    "content": "Winter Quarter is notorious for being pretty dead where everyone is just grinding. I took five classes this quarter, which was pretty chill until finals week came around and I had five finals in three days-which had three back-to-back-to-back on the third day. Honestly this one week turnaround into spring quarter might be the death of me. I am so exhausted. \n **Classes** \n MATH 61: Love Terrence George. Was my first formal introduction to proofs. I thought this class was super interesting, and was the one class that I didn't miss a single lecture. Made friends through this class. I swear this whole class was just CS majors. \n MATH 33B: I feel like this class was like a fever dream, but nevertheless learned some differential equations. \n CS 31: This grind was crazy in the last week leading up to the final. Projects were alright. I did good on the tests and assignments. Howard Stahl was a decent professor. Really nice guy. \n LS 30A: This class was all pre-meds and was really easy. I did have to attend all the lectures for iClicker questions, but the professor was really entertaining. I pretty much completely aced all the exams. Most of the content was interesting because I was used to math theory, and here it was all in real applications. \n ARTHIS 21: Our whole class got collective trauma from this. This class was unnecessarily stressful. I had a lovely TA Oliver Ruhl though. I did learn a lot about Istanbul, the Hagia Sophia, and various medieval artifacts. \n **Highlights:** Joined Bruin Sports Analytics, TBG Consulting, got a 4.0, went to UCSD for a swim meet, and made a ton of new friends while getting closer with existing friends. \n **Overall**: Positive experience. There wasn't a ton going on. It was mostly just a time to grind."
  }, 
  {
    "title": "Start of College",
    "date": "December 16, 2024",
    "content": "UCLA is the most beautiful campus ever, and I love the fact that all residential buildings are together. The food as delicious, and the people are super nice. I can't say my first quarter was a crazy experience, but it was certainly super comprehensive. I've never been so overstimulated with people everywhere, but I definitely love it. I honestly kind of forgot what happened this quarter. \n **Classes** \n MATH 33A: Love Pablo with all my heart. Took this class with Kimi, Shawn, Fiona, and Jeff. I missed this 8 am like three times the whole quarter. Adam Zheleznyak was an insanely good TA, and I went to a lot of his office hours. Was challenging at first, but became pretty smooth after Week 3. \n CHEM 20A: Did not enjoy this class, but did learn some quantum mechanics. I didn't take chemistry at all in high school, so this definitely wasn't super easy. \n ASTR 5: My professor was Neil DeGrasse Tyson's PhD advisor, which was the coolest thing ever. \n HIST 9D: Learned about the history of the Middle East and Islam from a famous professor, James Gelvin. The Israel-Hamas war started a few weeks into the class, so I feel like this was a really valuable class to learn more about the background of current events. \n **Overall**: Kind of a surreal experience. My room has the best view on the Hill."
  }
]
